src/integ-test/bdd-test/resources/xml/sendPaymentOutcomeV2Body_MBD_tokenFromActivateV2_noOptional.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <nod:sendPaymentOutcomeV2Request>
            <idPSP>#psp#</idPSP>
            <idBrokerPSP>#id_broker_psp#</idBrokerPSP>
            <idChannel>#canale_versione_primitive_2#</idChannel>
            <password>#password#</password>
            <paymentTokens>
                <paymentToken>$activatePaymentNoticeV2Response.paymentToken</paymentToken>
            </paymentTokens>
            <outcome>OK</outcome>
            <details>
                <paymentMethod>creditCard</paymentMethod>
                <fee>2.00</fee>
                <applicationDate>2021-12-12</applicationDate>
                <transferDate>2021-12-11</transferDate>
                <marcheDaBollo>
                    <marcaDaBollo>
                        <paymentToken>$activatePaymentNoticeV2Response.paymentToken</paymentToken>
                        <idTransfer>1</idTransfer>
                        <MBDAttachment>$bollo</MBDAttachment>
                    </marcaDaBollo>
                </marcheDaBollo>
            </details>
        </nod:sendPaymentOutcomeV2Request>
    </soapenv:Body>
</soapenv:Envelope>